clc; clear;

% Решение системы ДУ
[x, y] = ode45('system_DU', [0, 50], [1, 0]);

% а) Оба графика в одной системе координат
plot(x, y(:,1), x, y(:,2))
grid on
legend('y1', 'y2')

% б) Графики отдельно  
figure
subplot(2,1,1)
plot(x, y(:,1))
grid on
title('y1(x)')

subplot(2,1,2) 
plot(x, y(:,2))
grid on
title('y2(x)')

% Проверка начальных условий
y(1,1)  % y₁(0) - должно быть 1
y(1,2)  % y₂(0) - должно быть 0

% Нахождение значений при x = 10
y1_10 = interp1(x, y(:,1), 10)
y2_10 = interp1(x, y(:,2), 10)